Tekla Open API Reference for Tekla Structures 2025
LeaderLinePlacing Constructor
 Creates a new leader line placing instance. The given point defines the start point of the leader line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LeaderLinePlacing(
	Point LeaderLineStartPoint
)
Public Sub New (
	LeaderLineStartPoint As Point
)
Parameters
LeaderLineStartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point of the leader line.
See Also
Reference
LeaderLinePlacing Class
Tekla.Structures.Drawing Namespace